{
  "backend/main.mo": "Motoko canister providing CRUD-like APIs for mentors and video submissions using in‑memory maps with sortable listings and ID counters.",
  "feature_evidence.json": "Feature evidence report mapping UI text‑color updates to affected frontend files and components with associated test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files, mainly describing UI pages, components, and theme behavior.",
  "frontend/index.css": "Tailwind base CSS defining OKLCH color tokens for light/dark themes and setting global foreground/background variables.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the React Router route tree and renders the router provider with all application pages.",
  "frontend/src/components/AnimatedSection.tsx": "Intersection‑observer based wrapper that animates children into view with fade/slide effects.",
  "frontend/src/components/AppLayout.tsx": "Page layout component including header, footer, and outlet region for routed content.",
  "frontend/src/components/CopyBlock.tsx": "Utility component showing a title and copyable text block with visual feedback using clipboard API.",
  "frontend/src/components/FieldMultiSelect.tsx": "Popover‑driven multi‑select UI for choosing and displaying field tags with checkboxes and removable badges.",
  "frontend/src/components/Footer.tsx": "Footer showing logo, contact details, address, and attribution with themed text styling.",
  "frontend/src/components/HeaderNav.tsx": "Responsive header navigation with desktop and mobile menus highlighting the active route.",
  "frontend/src/components/MindmapNav.tsx": "Renders a multi‑step navigation grid linking to career-related pages with animated cards and icons.",
  "frontend/src/components/SafeVideoEmbed.tsx": "Parses a YouTube or Vimeo URL into a safe embed iframe or shows a fallback link if unsupported.",
  "frontend/src/config/contact.ts": "Exports placeholder contact info for email, phone, and address to be updated later.",
  "frontend/src/data/careers.ts": "Defines career interfaces and provides a list of fields and example careers with details like education and salary.",
  "frontend/src/data/quiz.ts": "Defines quiz structures, question data, and a scoring function that computes a result category based on answers.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor instance and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login state, identity loading, and auth client setup.",
  "frontend/src/hooks/useMentors.ts": "Wraps mentor-related actor calls with react-query for listing, fetching, and creating mentors.",
  "frontend/src/hooks/useVideos.ts": "Provides react-query hooks to list, fetch, and submit video submissions via the actor API.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for theming, including light/dark modes and background styling with gradients and textures.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider.",
  "frontend/src/pages/CareerQuizPage.tsx": "Implements an interactive multi-step career quiz with progress tracking, answer handling, and result display.",
  "frontend/src/pages/ExploreCareersPage.tsx": "Provides searchable and filterable browsing of career data with field-based relevance sorting.",
  "frontend/src/pages/HomePage.tsx": "Renders the main homepage with hero content, mindmap navigation, and information on university preparation.",
  "frontend/src/pages/MentorConnectionsPage.tsx": "Allows users to search for mentors or create mentor profiles, integrating forms, search filtering, and API hooks.",
  "frontend/src/pages/MentorProfilePage.tsx": "Displays a detailed mentor profile with qualifications, contact information, and loading/error handling.",
  "frontend/src/pages/ResourcesPage.tsx": "Renders a resources page with tabs for essays, resumes, brag sheets, and email templates, using cards, accordions, and animated sections. Provides structured guidance content with expandable sections.",
  "frontend/src/pages/SchoolTimelinePage.tsx": "Displays school exam timelines using cards and accordions, outlining AP, PSAT, and SAT dates and notes. Uses animated sections for layout transitions.",
  "frontend/src/pages/VideoDetailPage.tsx": "Fetches and displays details for a single video, including embedded playback, professional info, and navigation back to the videos list. Handles loading and error states with fallback UI.",
  "frontend/src/pages/VideosPage.tsx": "Provides video browsing with search, plus a form to submit new professional videos. Shows loading states, empty results, and video cards linking to detail pages.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, animations, typography, container queries, and extended theme settings. Registers plugins and global design tokens for the app.",
  "project_state.json": "Captures the project's metadata, features, and current state, describing the app's backend, frontend, videos, resources, timeline, and assets. Serves as a structured overview for build and planning."
}